{
    "experiences" : "My Experiences",
    "aboutMe" : "About Me",
    "aboutMe1" : "Hello, I'm Berkay. I am a third-year Computer Engineering student at Istanbul Altınbaş University. I took my first steps into the world of software during my final year of high school, starting with Python. Through courses at BTK Academy, I expanded my knowledge to include Java and Kotlin, earning certificates in these languages. In my first year at university, I had the opportunity to learn the C language.",
    "aboutMe2" :"In my second year, I joined the EVA Team club within the scope of my school. Within this club, I took on a role in the software division of autonomous unmanned aerial vehicles. We participated in the Technofest International Unmanned Aerial Vehicles competition with the Rotary Wing UAV and Fixed Wing UAV vehicles we developed, earning performance awards for both. Additionally, by applying to the Google Game and Application Academy, I had the opportunity to become an academy scholar. In this academy, I learned the Dart language and developed mobile applications with Flutter. Focused on continuous self-improvement, I leverage the knowledge and experiences gained during this process.",
    "aboutMe3" :"Furthermore, in my second year of school, I achieved the second position in my department. Alongside these accomplishments, I aim to establish a strong foundation for my future successes through both my active role in academics and projects.",

    "evaContent1" :"During my university education, active participation in the Unmanned Aerial Vehicles (UAV) Club has equipped me with a broad range of technical knowledge and practical skills. Throughout my time in this club, I focused on the Pixhawk flight control board, developing a deep understanding of the flight dynamics and control systems of UAVs. Additionally, I actively participated in the design and implementation of autonomous flight algorithms.",
    "evaContent2" :"To understand the interaction with telemetry systems, I gained experience in establishing communication with Pixhawk through telemetry in various scenarios. Additionally, I acquired the skill of establishing wired connections via mini computers such as Jetson and Raspberry integrated into our vehicles. Throughout this process, working with the Linux-based operating systems embedded in these mini computers, particularly, enhanced my troubleshooting abilities.",
    "evaContent3" :"One of my most notable projects was the development of a domestic desktop application initiated by the club this year. This application was designed as a tool to perform all parameter settings of the Pixhawk flight control board and to load and execute autonomous flight code. In this project, I took on responsibilities for developing the user interface using Electron.js and establishing communication with the vehicle using Python.",
    "evaContent4" :"In addition to these processes, I have gained extensive experience with Linux-based systems. Working on telemetry systems and mini computers with Linux-based operating systems, I developed competence in system administration and troubleshooting. The experiences gained in the UAV Club not only enhanced my technical skills but also made significant contributions to improving my teamwork, leadership, and effective project management abilities.",

    "sugarTechContent1" :"The 3-month internship I completed at Biruni Technopark provided a comprehensive experience and learning opportunity in the field of software development. I served as an intern software developer at Sugar Technology during this period, acquiring a broad spectrum of knowledge on various technologies.",
    "sugarTechContent2" :"During the internship, I actively participated in projects using popular technologies such as React, React Native, Unity, and Java Spring. I undertook tasks such as developing web applications with React, creating front-end designs for mobile applications using React Native and Unity, and writing back-end services for these applications with the Java Spring framework. Throughout this process, I had the opportunity to acquire a diverse skill set through both learning and hands-on application stages.",
    "sugarTechContent3" :"Furthermore, by working on different projects and utilizing various programming languages, I honed my problem-solving skills. I had the opportunity to develop effective communication skills within the team and gained practical experience in project management. This internship period not only enhanced my technical abilities but also provided a significant platform for becoming an effective team player.",

    "google" : "Google Game and Application Academy",
    "googleContent1":"In 2023, being accepted and awarded a scholarship at the Google Game and Application Academy encapsulates valuable experiences gained in software development and entrepreneurship. Within this academy, I actively utilized Flutter and Dart technologies to develop mobile applications and participated in comprehensive courses covering information technology law, project management, and entrepreneurship.",
    "googleContent2":"To successfully complete a challenging phase of the academy, I participated in a bootcamp process where, through teamwork, we developed a mobile application. The project was created using the MobX library in Flutter to effectively implement the state management concept. This experience not only enhanced my technical skills but also provided valuable practical insights into project management and team coordination.",
    "googleContent3":"The knowledge I gained at the Google Game and Application Academy, along with my leadership experience in projects, has strengthened my ability to be an effective contributor in future projects and teams. I am eager to bring these valuable experiences, combined with a broad technical skill set, including but not limited to Flutter and Dart, to contribute to your company.",

    "certificates" : "My Certificates",
    "kotlinBasic" : "Basic Level of Android Mobile Application Development Training with Kotlin",
    "kotlinAdvanced" :"Advanced Level of Android Mobile Application Development With Kotlin",
    "javaBasic" : "Introduction to Programming with JAVA",
    "javaAdvanced" : "Advanced Level Java",
    "projectsBasic" :"Game and Application Academy: Fundamentals of Project Management",
    "projectStart" :"Game and Application Academy: Successfully Stepping into the Project",
    "googleProject" :"Game and Application Academy: Deconstructing Everything Together",
    "googleFlutter" :"Game and Application Academy: Application Development with Flutter",
    "googleEntrepreneurship" : "Game and Application Academy: Technology Entrepreneurship",
    "teknofestAutonom" : "Robotaxi Passenger Autonomous Vehicle Competition Participation Certificate",
    "teknofestUav" : "Certificate of Participation in the International Unmanned Aerial Vehicles Vehicles Competition"
}