{
    "experiences" : "My Experiences",
    "aboutMe" : "About Me",
    "aboutMe1" : "Hello, I'm Berkay, a senior student at Istanbul Altınbaş University, majoring in Computer Engineering. I took my first step into the world of software during my high school years with Python. Through courses offered by BTK Academy, I learned Python, and later Java and Kotlin, earning certifications in these languages. In my first year of university, I had the opportunity to learn the C programming language.",
    "aboutMe2" :"In my second year, I joined the EVA Team club at my university, where I participated with my teammates in the Teknofest Autonomous Taxi and Unmanned Aerial Vehicle competitions for two seasons. Throughout these experiences, I gained invaluable skills and achieved significant success. Additionally, I was awarded a scholarship from the Google Game and Application Academy, where I learned Dart and developed mobile applications using Flutter.",
    "aboutMe3" :"Furthermore, I achieved second place in my department during my second year. With both my academic achievements and active participation in projects, I am laying a strong foundation for future success in the field of software development.",

    "evaContent1" :"During my university education, active participation in the Unmanned Aerial Vehicles (UAV) Club has equipped me with a broad range of technical knowledge and practical skills. Throughout my time in this club, I focused on the Pixhawk flight control board, developing a deep understanding of the flight dynamics and control systems of UAVs. Additionally, I actively participated in the design and implementation of autonomous flight algorithms.",
    "evaContent2" :"To understand the interaction with telemetry systems, I gained experience in establishing communication with Pixhawk through telemetry in various scenarios. Additionally, I acquired the skill of establishing wired connections via mini computers such as Jetson and Raspberry integrated into our vehicles. Throughout this process, working with the Linux-based operating systems embedded in these mini computers, particularly, enhanced my troubleshooting abilities.",
    "evaContent3" :"One of my most notable projects was the development of a domestic desktop application initiated by the club this year. This application was designed as a tool to perform all parameter settings of the Pixhawk flight control board and to load and execute autonomous flight code. In this project, I took on responsibilities for developing the user interface using Electron.js and establishing communication with the vehicle using Python.",
    "evaContent4" :"In addition to these processes, I have gained extensive experience with Linux-based systems. Working on telemetry systems and mini computers with Linux-based operating systems, I developed competence in system administration and troubleshooting. The experiences gained in the UAV Club not only enhanced my technical skills but also made significant contributions to improving my teamwork, leadership, and effective project management abilities.",

    "sugarTechContent1" :"The 3-month internship I completed at Biruni Technopark provided a comprehensive experience and learning opportunity in the field of software development. I served as an intern software developer at Sugar Technology during this period, acquiring a broad spectrum of knowledge on various technologies.",
    "sugarTechContent2" :"During the internship, I actively participated in projects using popular technologies such as React, React Native, Unity, and Java Spring. I undertook tasks such as developing web applications with React, creating front-end designs for mobile applications using React Native and Unity, and writing back-end services for these applications with the Java Spring framework. Throughout this process, I had the opportunity to acquire a diverse skill set through both learning and hands-on application stages.",
    "sugarTechContent3" :"Furthermore, by working on different projects and utilizing various programming languages, I honed my problem-solving skills. I had the opportunity to develop effective communication skills within the team and gained practical experience in project management. This internship period not only enhanced my technical abilities but also provided a significant platform for becoming an effective team player.",

    "tubitakContent1" : "During my 20-day summer internship at the Corporate Applications Department of TÜBİTAK BİLGEM, I gained numerous valuable experiences.",
    "tubitakContent2" : "In the first weeks of my internship, I successfully completed two projects using React. I utilized the PrimeReact and PrimeFlex libraries to ensure the projects were fully responsive, optimizing the user experience and ensuring seamless functionality across various screen sizes.",
    "tubitakContent3" : "In the remaining days, I focused on researching and working with widely used technologies such as Jenkins, Sentry, SonarQube, RabbitMQ, and ElasticSearch. I also integrated Sentry into a project, contributing to the error tracking and reporting processes.",
    "tubitakContent4" : "This internship not only enhanced my technical knowledge and skills but also taught me the importance of teamwork and collaboration in a professional environment. Along with the valuable experiences I gained in a short time, I also had the opportunity to meet many wonderful people at TÜBİTAK BİLGEM and made lasting friendships.",

    "google" : "Google Game and Application Academy",
    "googleContent1":"In 2023, being accepted and awarded a scholarship at the Google Game and Application Academy encapsulates valuable experiences gained in software development and entrepreneurship. Within this academy, I actively utilized Flutter and Dart technologies to develop mobile applications and participated in comprehensive courses covering information technology law, project management, and entrepreneurship.",
    "googleContent2":"To successfully complete a challenging phase of the academy, I participated in a bootcamp process where, through teamwork, we developed a mobile application. The project was created using the MobX library in Flutter to effectively implement the state management concept. This experience not only enhanced my technical skills but also provided valuable practical insights into project management and team coordination.",
    "googleContent3":"The knowledge I gained at the Google Game and Application Academy, along with my leadership experience in projects, has strengthened my ability to be an effective contributor in future projects and teams. I am eager to bring these valuable experiences, combined with a broad technical skill set, including but not limited to Flutter and Dart, to contribute to your company.",

    "certificates" : "My Certificates",
    "kotlinBasic" : "Basic Level of Android Mobile Application Development Training with Kotlin",
    "kotlinAdvanced" :"Advanced Level of Android Mobile Application Development With Kotlin",
    "javaBasic" : "Introduction to Programming with JAVA",
    "javaAdvanced" : "Advanced Level Java",
    "projectsBasic" :"Game and Application Academy: Fundamentals of Project Management",
    "projectStart" :"Game and Application Academy: Successfully Stepping into the Project",
    "googleProject" :"Game and Application Academy: Deconstructing Everything Together",
    "googleFlutter" :"Game and Application Academy: Application Development with Flutter",
    "googleEntrepreneurship" : "Game and Application Academy: Technology Entrepreneurship",
    "teknofestAutonom" : "Robotaxi Passenger Autonomous Vehicle Competition Participation Certificate",
    "teknofestUav23" : "Certificate of Participation in the International Unmanned Aerial Vehicles Vehicles Competition 2023",
    "teknofestUav24" : "Certificate of Participation in the International Unmanned Aerial Vehicles Vehicles Competition 2024",

    "myProjects" : "My Projects",
    "projectUavTitle" : "Desktop application for flight cards of UAVs",
    "socialMediaTitle" : "Mobile social media application for people who looking for sport friend",
    "socialMedaContent1" : "The purpose of the application is to provide a platform for people who enjoy exercising but are tired of doing it alone, allowing them to find workout partners. Users can create events by selecting the location where they will exercise on the map, specifying the type of sport they will be doing, and entering the time information. While creating an event, users can also add details such as descriptions and photos. Once the event is created, it appears on the maps of other users, who can send a request to join the event. With approved requests, users can communicate through the in-app messaging feature and get to know each other before starting their workout.",
    "socialMedaContent2":"For this project, I used React Native for the front-end and Node.js with the Express framework for the back-end. I integrated SocketIO for messaging and real-time communication features, and so far, I have completed about 70% of the project. It is a project I am still actively developing.",
    "uavContent1" : "The purpose of this project is to modify the flight control card (Pixhawk) parameters of UAVs and monitor the complete control of the UAV during flight. It also enables the UAV to perform autonomous flights. Another feature of the application is the ability to view the live feed from a camera mounted on the UAV, if available.",
    "uavContent2" : "Our project has qualified for support under TÜBİTAK 2209-A - Research Project Support Program for University Students.",
    "uavContent3" : "For the front-end, we developed a cross-platform desktop application using Electron.js. In terms of communication with the vehicle, we utilized the 'dronekit' and 'pymavlink' libraries in Python. We used SocketIO to transfer data to the interface. We actively used the project in the Teknofest International Unmanned Aerial Vehicle Competition and achieved successful results.",
    "techs":"My Tech and Tool Stack"


}