{
    "experiences" : "Tecrübelerim",
    "aboutMe" : "Hakkımda",
    "aboutMe1" : "Merhaba, ben Berkay. İstanbul Altınbaş Üniversitesi'nde Bilgisayar Mühendisliği bölümü üçüncü sınıf öğrencisiyim. Yazılım dünyasına lise son sınıfta Python ile adım attım. BTK Akademi'deki derslerle başlangıçta Python, ardından Java ve Kotlin dillerini öğrenerek bu alanlardaki sertifikalarımı aldım. Okulumun 1. sınıfında C dilini öğrenme fırsatı buldum.",
    "aboutMe2" : "2. sınıfta, okulum bünyesinde yer alan EVA Team kulübüne katıldım. Bu kulüpte, otonom insansız hava araçlarının yazılım bölümünde görev aldım. Teknofest Uluslararası İnsansız Hava Araçları yarışmasında geliştirdiğimiz Döner Kanat İHA ve Sabit Kanat İHA araçlarıyla katıldık ve her iki araçta da performans ödülü almaya hak kazandık. Ayrıca, Google Oyun ve Uygulama Akademisi'ne başvurarak akademi bursiyeri olma şansı elde ettim. Bu akademide Dart dilini öğrenerek Flutter ile birlikte mobil uygulamalar geliştirdim. Bu süreçte edindiğim bilgi ve deneyimlerle kendimi sürekli geliştirmeye odaklanıyorum.",
    "aboutMe3" :"Ayrıca, okulumun 2. sınıfında bölüm ikinciliğimi elde ettim, bu başarılarla birlikte hem akademik hem de projelerdeki aktif rolümle gelecekteki başarılarıma sağlam bir temel oluşturmayı hedefliyorum.",
    
    "evaContent1" :"Üniversite eğitimim süresince aktif olarak katıldığım İnsansız Hava Araçları (İHA) Kulübü, beni geniş bir teknik bilgi ve uygulama yelpazesi ile donatmıştır. Bu kulüpte geçirdiğim süre zarfında, Pixhawk uçuş kontrol kartı üzerinde yoğunlaşarak İHA'ların uçuş dinamikleri ve kontrol sistemleri konusunda derin bir anlayış geliştirdim. Ayrıca, otonom uçuş algoritmalarının tasarımı ve uygulanması süreçlerinde aktif rol aldım.",
    "evaContent2" : "Telemetri sistemleriyle olan etkileşimi anlamak adına Pixhawk'a çeşitli senaryolarda telemetri ile iletişim kurma deneyimim oldu. Bunun yanı sıra, araçlarımıza entegre ettiğimiz Jetson ve Raspberry gibi mini bilgisayarlar aracılığıyla kablolu bağlantı sağlama becerisi edindim. Bu süreçte, özellikle bu mini bilgisayarların içinde barındırdığı Linux tabanlı işletim sistemleri ile çalışmak, sorun giderme yeteneklerimi geliştirdi.",
    "evaContent3":"En dikkat çekici projelerimden biri, bu yıl içinde kulüp olarak başlattığımız yerli bir masaüstü uygulaması oldu. Bu uygulama, Pixhawk uçuş kontrol kartının bütün parametre ayarlarını gerçekleştirebilmemizi ve otonom uçuş kodunu yükleyip çalıştırabilmemizi sağlayacak bir araç olarak tasarlandı. Bu projede, Electron.js kullanarak kullanıcı arayüzünü geliştirme ve Python ile araçla iletişimi sağlama sorumluluklarını üstlendim.",
    "evaContent4" : "Bu süreçlerin yanı sıra, Linux tabanlı sistemlerle ilgili geniş bir deneyim kazandım. Telemetri sistemlerinde ve mini bilgisayarlarda Linux tabanlı işletim sistemleri üzerinde çalışarak, sistem yönetimi ve sorun giderme konularında yetkinlik kazandım. İHA Kulübü'nde edindiğim bu tecrübeler, sadece teknik becerilerimi değil, aynı zamanda ekip çalışması, liderlik ve projeleri etkili bir şekilde yönetme yeteneklerimi de geliştirmeme büyük katkı sağladı.",
    
    "sugarTechContent1" :"Biruni Teknopark'ta gerçekleştirdiğim 3 aylık staj süreci, yazılım geliştirme alanında kapsamlı bir deneyim ve öğrenme fırsatı sunmuştur. Sugar Technology şirketinde stajyer yazılım geliştirici olarak görev aldım ve bu süre zarfında çeşitli teknolojilere dair geniş bir bilgi yelpazesi edindim.",
    "sugarTechContent2" :"Staj kapsamında özellikle React, React Native, Unity ve Java Spring gibi popüler teknolojileri kullanarak projelerde yer aldım. React ile web uygulamalarının geliştirilmesi, React Native ve Unity kullanılarak mobil uygulamaların ön yüz tasarımlarının oluşturulması, Java Spring framework'ü ile bu uygulamaların back-end servislerinin yazılması gibi görevleri üstlendim. Bu süreçte, hem öğrenme hem de uygulama aşamalarında geniş bir beceri seti elde etme şansı buldum.",
    "sugarTechContent3" :"Ayrıca, farklı projelerde ve çeşitli programlama dillerinde çalışarak problem çözme yeteneklerimi geliştirdim. Ekip içinde etkili iletişim becerileri kazanma fırsatı buldum ve proje yönetimi konusunda pratik deneyimler elde ettim. Bu staj süreci, teknik yeteneklerimi artırmanın yanı sıra takım içinde etkili bir oyuncu olabilmek adına da önemli bir platform sağladı.",

    "google" : "Google Oyun ve Uygulama Akademisi",
    "googleContent1" :"2023 yılında Google Oyun ve Uygulama Akademisi'ne kabul edilerek bursiyer olarak seçilmek, yazılım geliştirme ve girişimcilik alanında kazandığım değerli deneyimleri içermektedir. Bu akademi kapsamında, Flutter ve Dart teknolojilerini etkin bir şekilde kullanarak mobil uygulama geliştirmenin yanı sıra, bilişim hukuku, proje yönetimi ve girişimcilik konularında kapsamlı derslere katıldım.",
    "googleContent2" :"Akademinin zorlu bir aşamasını başarıyla tamamlamak adına, bir bootcamp sürecine katıldım ve bu süreçte ekip çalışmasıyla bir mobil uygulama geliştirdik. Proje, Flutter'daki state management konseptini etkili bir şekilde uygulamak amacıyla MobX kütüphanesini kullanarak geliştirildi. Bu süreç, sadece teknik becerilerimi geliştirmekle kalmayıp aynı zamanda proje yönetimi ve ekip koordinasyonu konusunda önemli pratik bilgiler edinmemi sağladı.",
    "googleContent3" :"Google Oyun ve Uygulama Akademisi'nde elde ettiğim bilgi birikimi ve projelerimdeki liderlik deneyimi, gelecekteki projelerde ve ekiplerde etkili bir katılımcı olma yeteneğimi güçlendirmiştir. Bu değerli deneyimleri, başta Flutter ve Dart olmak üzere geniş bir teknik yelpaze ile birleştirerek, şirketinize getirmek için sabırsızlanıyorum.",

    "certificates" : "Sertifikalarım",
    "kotlinBasic" : "Kotlin İle Android Mobil Uygulama Geliştirme Eğitimi Temel Seviye",
    "kotlinAdvanced" : "Kotlin İle Android Mobil Uygulama Geliştirme İleri Seviye",
    "javaBasic" : "JAVA İle Programlamaya Giriş",
    "javaAdvanced" : "İleri Seviye Java",
    "projectsBasic" :"Oyun ve Uygulama Akademisi: Proje Yönetiminin Temelleri",
    "projectStart" :"Oyun ve Uygulama Akademisi: Projeye Başarıyla Adım Atma",
    "googleProject" :"Oyun ve Uygulama Akademisi: Her Şeyi Bir Araya Getirmek",
    "googleFlutter": "Oyun ve Uygulama Akademisi: Flutter ile Uygulama Geliştirme",
    "googleEntrepreneurship" : "Oyun ve Uygulama Akademisi: Teknoloji Girişimciliği",
    "teknofestAutonom" : "Robotaksi Binek Otonom Araç Yarışması Katılım Belgesi",
    "teknofestUav" :"Uluslararası İnsansız Hava Araçları Araçları Yarışması Katılım Belgesi"


}